=============
function call
=============

fn();

---

(source_file
  (expression_statement
    (call_expression
      (identifier)
      (argument_list))))

===========================
optional function arguments
===========================

function test(?a,b,?c) {}

---

(source_file
    (function_declaration
      (keyword_function)
      (identifier)
      (parameter_list
        (parameter
          (optional)
          (identifier))
        (parameter
          (identifier))
        (parameter
          (optional)
          (identifier)))
      (block_statement)))

===========================
default function arguments
===========================

function test(a="test", b=23, ?c=11) {}

---

(source_file
  (function_declaration
    (keyword_function)
    name: (identifier)
    parameters: (parameter_list
      (parameter
        name: (identifier)
        value: (string
          (string_fragment)))
      (parameter
        name: (identifier)
        value: (integer))
      (parameter
        (optional)
        name: (identifier)
        value: (integer)))
    body: (block_statement)))

===================
arrow function
===================

() -> trace("some");
() -> {};
a -> {};
(a,b) -> trace(a,b);

---

(source_file
  (expression_statement
    (arrow_function
      parameters: (parameter_list)
      body: (call_expression
        function: (identifier)
        args: (argument_list
          (string
            (string_fragment))))))
  (expression_statement
    (arrow_function
      parameters: (parameter_list)
      body: (object)))
  (expression_statement
    (arrow_function
      parameters: (identifier)
      body: (object)))
  (expression_statement
    (arrow_function
      parameters: (parameter_list
        (parameter
          name: (identifier))
        (parameter
          name: (identifier)))
      body: (call_expression
        function: (identifier)
        args: (argument_list
          (identifier)
          (identifier))))))

===================================
function with return statement body
===================================

function test() return 23;

---

(source_file
  (function_declaration
    (keyword_function)
    name: (identifier)
    parameters: (parameter_list)
    body: (return_statement
      (integer))))
