===============================================================================
macro constant expression
===============================================================================

macro 42;

---

(module
  (EMacro
    (EConst
      (Int))))

===============================================================================
macro
===============================================================================

macro 1 + 2;

---

(module
  (EMacro
    (EBinop
      left: (EConst
        (Int))
      right: (EConst
        (Int)))))


===============================================================================
macro expression value reification
===============================================================================

macro $v{someExpr};

---

(module
  (EMacro
    (EMacroInterpolation
      (EConst
        (identifier)))))


===============================================================================
macro compile‚Äêtime value refication
===============================================================================

macro { trace("hi"); }
macro $v{myValue}
macro $a{1, 2, 3}
macro $b{ trace(1); trace(2); }
macro $i{name}
macro $p{x, y, z}
macro $v{v} * 2;

---

(module
  (EMacro
    (EBlock
      (ECall
        callee: (identifier)
        args: (EConst
          (String
            (fragment))))))
  (EMacro
    (EMacroInterpolation
      (EConst
        (identifier))))
  (EMacro
    (EMacroInterpolation
      (EConst
        (Int))
      (EConst
        (Int))
      (EConst
        (Int))))
  (EMacro
    (EMacroInterpolation
      (ECall
        callee: (identifier)
        args: (EConst
          (Int)))
      (ECall
        callee: (identifier)
        args: (EConst
          (Int)))))
  (EMacro
    (EMacroInterpolation
      (identifier)))
  (EMacro
    (EMacroInterpolation
      (identifier)
      (identifier)
      (identifier)))
  (EMacro
    (EBinop
      left: (EMacroInterpolation
        (EConst
          (identifier)))
      right: (EConst
        (Int)))))
