===============================================================================
macro
===============================================================================

macro 1 + 2;

---

(module
  (EMacro
    (EBinop
      left: (EConst
        (Int))
      right: (EConst
        (Int)))))

===============================================================================
macro constant expression reification
===============================================================================

macro 42;

---

(module
  (EMacro
    (EConst
      (Int))))

===============================================================================
macro expression value reification
===============================================================================

macro $v{someExpr};

---

(module
  (EMacro
    (EMacroInterpolation
      (identifier))))


===============================================================================
macro compile‚Äêtime value refication
===============================================================================

macro $v{v} * 2;

---

(module
  (EMacro
    (EBinop
      left: (EMacroInterpolation
        (identifier))
      right: (EConst
        (Int)))))
