===============================================================================
macro constant expression
===============================================================================

macro 42;

---

(module
  (macro
    (EConst
      (Int))))

===============================================================================
macro
===============================================================================

macro 1 + 2;

---

(module
  (macro
    (EBinop
      left: (EConst
        (Int))
      right: (EConst
        (Int)))))


===============================================================================
macro expression value reification
===============================================================================

macro $v{someExpr};

---

(module
  (macro
    (reification
      (EConst
        (identifier)))))


===============================================================================
macro compile‚Äêtime value refication
===============================================================================

macro { trace("hi"); };
macro $v{myValue};
macro $a{1, 2, 3};
macro $b{ trace(1); trace(2); };
macro $i{name};
macro $p{x, y, z};
macro $v{v} * 2;

---

(module
  (macro
    (EBlock
      (ECall
        callee: (identifier)
        args: (EConst
          (String
            (fragment))))))
  (macro
    (reification
      (EConst
        (identifier))))
  (macro
    (reification
      (EConst
        (Int))
      (EConst
        (Int))
      (EConst
        (Int))))
  (macro
    (reification
      (ECall
        callee: (identifier)
        args: (EConst
          (Int)))
      (ECall
        callee: (identifier)
        args: (EConst
          (Int)))))
  (macro
    (reification
      (identifier)))
  (macro
    (reification
      (identifier)
      (identifier)
      (identifier)))
  (macro
    (EBinop
      left: (reification
        (EConst
          (identifier)))
      right: (EConst
        (Int)))))
